#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-cloud-dictionary/runs/run-bVeLV6vf7uGiHDfY

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.lambda_zip: Reading...
module.lambda.data.archive_file.lambda_zip: Read complete after 0s [id=808c13d893fbfdb2a60b23924bce0395771674c6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_account.main will be created
  + resource "aws_api_gateway_account" "main" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_iam_role.api_gateway_logging will be created
  + resource "aws_iam_role" "api_gateway_logging" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "APIGatewayCloudWatchLogsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.api_gateway_logging will be created
  + resource "aws_iam_role_policy_attachment" "api_gateway_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "APIGatewayCloudWatchLogsRole"
    }

  # module.api.aws_api_gateway_deployment.prod will be created
  + resource "aws_api_gateway_deployment" "prod" {
      + created_date  = (known after apply)
      + description   = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.api.aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_method.get_term will be created
  + resource "aws_api_gateway_method" "get_term" {
      + api_key_required     = false
      + authorization        = "NONE"
      + http_method          = "GET"
      + id                   = (known after apply)
      + request_parameters   = {
          + "method.request.querystring.term" = true
        }
      + request_validator_id = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
    }

  # module.api.aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = false
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.api.aws_api_gateway_request_validator.dictionary_validator will be created
  + resource "aws_api_gateway_request_validator" "dictionary_validator" {
      + id                          = (known after apply)
      + name                        = "search-validator"
      + rest_api_id                 = (known after apply)
      + validate_request_body       = false
      + validate_request_parameters = true
    }

  # module.api.aws_api_gateway_resource.search will be created
  + resource "aws_api_gateway_resource" "search" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "search"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_rest_api.dictionary_api will be created
  + resource "aws_api_gateway_rest_api" "dictionary_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "CloudDictionaryAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }

      + endpoint_configuration (known after apply)
    }

  # module.api.aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "prod"
      + tags_all             = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true
    }

  # module.api.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "CloudDictionaryHandler"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.app.aws_amplify_app.dictionary_frontend will be created
  + resource "aws_amplify_app" "dictionary_frontend" {
      + access_token                = (sensitive value)
      + arn                         = (known after apply)
      + build_spec                  = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - cd frontend
                    - npm install --no-audit --no-fund --loglevel=error
                build:
                  commands:
                    - echo "REACT_APP_API_URL=$REACT_APP_API_URL" >> .env
                    - npm run build
              artifacts:
                baseDirectory: frontend/build
                files:
                  - '**/*'
              cache:
                paths:
                  - frontend/node_modules/**/*
        EOT
      + custom_headers              = (known after apply)
      + default_domain              = (known after apply)
      + enable_auto_branch_creation = true
      + environment_variables       = (known after apply)
      + id                          = (known after apply)
      + name                        = "cloud-dictionary-app"
      + platform                    = "WEB"
      + production_branch           = (known after apply)
      + repository                  = "https://github.com/ShenLoong99/aws-terraform-cloud-dictionary"
      + tags_all                    = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }

      + auto_branch_creation_config (known after apply)

      + cache_config (known after apply)
    }

  # module.app.aws_amplify_branch.main will be created
  + resource "aws_amplify_branch" "main" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "main"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = false
      + framework            = "React"
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + tags_all             = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
    }

  # module.app.aws_amplify_webhook.build_webhook will be created
  + resource "aws_amplify_webhook" "build_webhook" {
      + app_id      = (known after apply)
      + arn         = (known after apply)
      + branch_name = "main"
      + description = "Triggered by Terraform Cloud"
      + id          = (known after apply)
      + url         = (known after apply)
    }

  # module.app.null_resource.curl_webhook will be created
  + resource "null_resource" "curl_webhook" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
          + "env_vars"   = (known after apply)
        }
    }

  # module.database.aws_dynamodb_table.dictionary_table will be created
  + resource "aws_dynamodb_table" "dictionary_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Term"
      + id               = (known after apply)
      + name             = "CloudDictionary"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Term"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["API Gateway"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Fully managed service to create, publish, and secure APIs at scale."
                }
              + Term       = {
                  + S = "API GATEWAY"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Auto Scaling"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Automatically adjusts capacity to maintain steady performance."
                }
              + Term       = {
                  + S = "AUTO SCALING"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["CloudFormation"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Provides a common language for you to describe and provision all the infrastructure resources."
                }
              + Term       = {
                  + S = "CLOUDFORMATION"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["CloudFront"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A fast content delivery network (CDN) service."
                }
              + Term       = {
                  + S = "CLOUDFRONT"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["CloudTrail"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A service that enables governance, compliance, and auditing of your AWS account."
                }
              + Term       = {
                  + S = "CLOUDTRAIL"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["CloudWatch"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Monitoring and observability service for AWS resources."
                }
              + Term       = {
                  + S = "CLOUDWATCH"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["CodePipeline"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A fully managed continuous delivery service that helps you automate your release pipelines."
                }
              + Term       = {
                  + S = "CODEPIPELINE"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["DynamoDB"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A fast, flexible NoSQL database service for single-digit millisecond latency."
                }
              + Term       = {
                  + S = "DYNAMODB"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["EBS"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Elastic Block Store - High-performance block storage for use with EC2."
                }
              + Term       = {
                  + S = "EBS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["EC2"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Elastic Compute Cloud - Virtual servers for running applications."
                }
              + Term       = {
                  + S = "EC2"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["EFS"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Elastic File System - Scalable, managed NFS file storage for AWS services."
                }
              + Term       = {
                  + S = "EFS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Elastic Beanstalk"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Service for deploying and scaling web applications and services."
                }
              + Term       = {
                  + S = "ELASTIC BEANSTALK"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Elastic IP"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A static IPv4 address designed for dynamic cloud computing."
                }
              + Term       = {
                  + S = "ELASTIC IP"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Fargate"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A serverless compute engine for containers that works with ECS and EKS."
                }
              + Term       = {
                  + S = "FARGATE"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Glacier"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A low-cost storage service for data archiving and long-term backup."
                }
              + Term       = {
                  + S = "GLACIER"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["IAM"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Identity and Access Management - Securely manage access to AWS services."
                }
              + Term       = {
                  + S = "IAM"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Internet Gateway"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A gateway that allows communication between your VPC and the internet."
                }
              + Term       = {
                  + S = "INTERNET GATEWAY"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Kinesis"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A platform for streaming data on AWS, making it easy to load and analyze video and data streams."
                }
              + Term       = {
                  + S = "KINESIS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Lambda"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Serverless compute service that runs code in response to events."
                }
              + Term       = {
                  + S = "LAMBDA"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["NAT Gateway"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Allows instances in a private subnet to connect to services outside your VPC."
                }
              + Term       = {
                  + S = "NAT GATEWAY"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["RDS"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Relational Database Service - Managed relational databases like MySQL/PostgreSQL."
                }
              + Term       = {
                  + S = "RDS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Redshift"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A fast, fully managed data warehouse that makes it simple to analyze data."
                }
              + Term       = {
                  + S = "REDSHIFT"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Route 53"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A scalable Domain Name System (DNS) web service."
                }
              + Term       = {
                  + S = "ROUTE 53"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Route Table"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A set of rules (routes) used to determine where network traffic is directed."
                }
              + Term       = {
                  + S = "ROUTE TABLE"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["S3"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Simple Storage Service - Scalable object storage in the cloud."
                }
              + Term       = {
                  + S = "S3"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["SNS"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Simple Notification Service - Pub/sub messaging for microservices."
                }
              + Term       = {
                  + S = "SNS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["SQS"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Simple Queue Service - Fully managed message queuing service."
                }
              + Term       = {
                  + S = "SQS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["SageMaker"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A fully managed service that provides every developer with the ability to build, train, and deploy ML models."
                }
              + Term       = {
                  + S = "SAGEMAKER"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["Step Functions"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "A serverless function orchestrator that makes it easy to sequence AWS Lambda functions."
                }
              + Term       = {
                  + S = "STEP FUNCTIONS"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.database.aws_dynamodb_table_item.dictionary_items["VPC"] will be created
  + resource "aws_dynamodb_table_item" "dictionary_items" {
      + hash_key   = "Term"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + Definition = {
                  + S = "Virtual Private Cloud - A private, isolated section of the AWS cloud."
                }
              + Term       = {
                  + S = "VPC"
                }
            }
        )
      + table_name = "CloudDictionary"
    }

  # module.lambda.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/CloudDictionaryHandler"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
    }

  # module.lambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud_dictionary_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda.aws_iam_role_policy.lambda_dynamo_policy will be created
  + resource "aws_iam_role_policy" "lambda_dynamo_policy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda.aws_iam_role_policy.lambda_logging will be created
  + resource "aws_iam_role_policy" "lambda_logging" {
      + id          = (known after apply)
      + name        = "lambda_logging_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda.aws_iam_role_policy.lambda_sqs_policy will be created
  + resource "aws_iam_role_policy" "lambda_sqs_policy" {
      + id          = (known after apply)
      + name        = "LambdaDLQPolicy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda.aws_lambda_function.dictionary_handler will be created
  + resource "aws_lambda_function" "dictionary_handler" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/lambda/lambda_function.zip"
      + function_name                  = "CloudDictionaryHandler"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "YEBegCjXVjg/AEM5cA4eaBTuhnaFZb0ImpDjJsJgGGs="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TABLE_NAME" = "CloudDictionary"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.aws_sqs_queue.lambda_dlq will be created
  + resource "aws_sqs_queue" "lambda_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "CloudDictionary-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "OwnedBy"     = "ShenLoong"
          + "Project"     = "CloudDictionary"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 54 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + amplify_app_id      = (known after apply)
  + amplify_app_url     = (known after apply)
  + amplify_branch_name = "main"
  + api_endpoint        = (known after apply)
  + api_invoke_url      = (known after apply)
  + aws_region          = "ap-southeast-1"
  + dynamodb_table_name = "CloudDictionary"

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0

```

</details>